from transformers import AutoTokenizer, AutoModelForCausalLM
import torch

# define device
device = 'cuda' if torch.cuda.is_available() else 'cpu'
print(f"Using device: {device}")

# import model
model_path = "scb10x/typhoon-7b"
tokenizer = AutoTokenizer.from_pretrained(model_path)
model = AutoModelForCausalLM.from_pretrained(model_path, device_map=device, torch_dtype=torch.float16)

instr0 = '''คุณคือนักวิเคราะห์หุ้นไทยมืออาชีพ ที่มีความสามารถในการวิเคราะห์หุ้นรายตัว และต้องเขียนบทวิเคราะห์หุ้น เพื่อนำเสนองานวิจัยออกไปสู่สาธารณะเป็นภาษาไทย
ชื่อหุ้น:
PTT
ข้อมูลเชิงลึก:
"-  กำไรสุทธิ 1Q67 2.9 หมื่นล้านบาท (-12% QoQ, +4 YoY)
-  รายการพิเศษ -1.1 หมื่นล้านบาท คือ กำไรจากสต๊อก 2.6 พันล้านบาท และ FX & Derivatives -1.4 หมื่นล้านบาท
-  Operating Profit 4.0 หมื่นล้านบาท (+72% QoQ, +55% YoY)
-  EBITDA ธุรกิจก๊าซ 1.8 หมื่นล้านบาท (+3% QoQ, +62% YoY)
-  ปริมาณขาย 4,494 MMSCF (+6% QoQ, +10% YoY)
-  จ่ายเงินปันผลทั้งปี 2 บาท/หุ้น"
ข่าวสาร/เหตการณ์ที่เกี่ยวข้อง:
- กำไรสุทธิลดมี QoQ ลดลงเพราะรายการพิเศษ
-  Operation Profit มี QoQ เพิ่มขึ้นจากธุรกิจ P&R, ธุรกิจน้ำมันและการค้าปลีก(OR)กำไรต้นต่อลิตรเพิ่มขึ้น, ธุรกิจ lifestyle ธุรกิจ Trading และธุรกิจก๊าซธรรมชาติเพิ่มขึ้น
-  Operation Profit มี YoY เพิ่มขึ้นจากธุรกิจ P&R  ธุรกิจน้ำมันและการค้าปลีก(OR) และธุรกิจก๊าซธรรมชาติเพิ่มขึ้น
-  EBITDA เพิ่มขึ้นจากปริมาณการขายที่เพิ่มขึ้น ซึ่งเกิดจากความต้องการในกลุ่มโรงไฟฟ้าเพิ่มขึ้นตามฤดูการและโรงแยกก๊าซ, ราคาขายอ้างอิงผลิตภัณฑ์ปิโตรเคมีเพิ่มขึ้น, ธุรกิจระบบท่อก๊าซมีต้นทุนลดลง, ธุรกิจ NGV ขาดทุนลดลง,PTTLNG มีปริมาณจองใข้เพิ่มขึ้น
-  คาดการว่ากำไร 2Q67 จะลดลงทั้ง QoQ และ YoY เนื่องจากค่าการกลั่นลดลง, สเปรดปิโตรเคมีลดลง, กำไรจากธุรกิจก๊าซลดลง, อัตราค่าบริการจัดหาและค่าส่งก๊าซของ SSP ปรับลดลง, กำไรจาก PE LNG ลดลง, GPSC เพิ่มขึ้น, ส่วนแบ่งกำไรจากไซยะบุรีเร่งตัวขึ้น
-  แนะนำให้ซื้อเมื่ออ่อนตัว เพราะยังได้รับการกดดันราคาหุ้นจากนโยบายปรับโครงสร้างราคาก๊าซของภาครัฐ (Single pool gas) และ กกพ.เรียก Shortfall เพิ่ม
- ปัจจัยเสี่ยงที่พบคือภาวะชะลอตัวของเศรษฐกิจโลกและอัตราแลกเปลี่ยนมีความผันผวนและต่ำกว่าประมาณการ"
จงเขียนบทวิเคราะห์หุ้นรายตัวจากข้อมูลข้างต้นเท่านั้น โดยไม่มีหัวข้ออื่นๆนอกเหนือจากการวิเคราะห์
'''

instr1 = '''คุณคือนักวิเคราะห์หุ้นไทยมืออาชีพ ที่มีความสามารถในการวิเคราะห์หุ้นรายตัว และต้องเขียนบทวิเคราะห์หุ้น เพื่อนำเสนองานวิจัยออกไปสู่สาธารณะเป็นภาษาไทย
จงเขียนบทวิเคราะห์หุ้นรายตัวจากข้อมูลและตัวอย่างต่อไปนี้ โดยไม่มีหัวข้ออื่นๆนอกเหนือจากการวิเคราะห์
```
ตัวอย่าง:
Input ชื่อหุ้น:
PTT
Input ข้อมูลเชิงลึก:
"-  กำไรสุทธิ 1Q67 2.9 หมื่นล้านบาท (-12% QoQ, +4 YoY)
-  รายการพิเศษ -1.1 หมื่นล้านบาท คือ กำไรจากสต๊อก 2.6 พันล้านบาท และ FX & Derivatives -1.4 หมื่นล้านบาท
-  Operating Profit 4.0 หมื่นล้านบาท (+72% QoQ, +55% YoY)
-  EBITDA ธุรกิจก๊าซ 1.8 หมื่นล้านบาท (+3% QoQ, +62% YoY)
-  ปริมาณขาย 4,494 MMSCF (+6% QoQ, +10% YoY)
-  จ่ายเงินปันผลทั้งปี 2 บาท/หุ้น"
Input ข่าวสาร/เหตการณ์ที่เกี่ยวข้อง:
"- กำไรสุทธิลดมี QoQ ลดลงเพราะรายการพิเศษ
-  Operation Profit มี QoQ เพิ่มขึ้นจากธุรกิจ P&R, ธุรกิจน้ำมันและการค้าปลีก(OR)กำไรต้นต่อลิตรเพิ่มขึ้น, ธุรกิจ lifestyle ธุรกิจ Trading และธุรกิจก๊าซธรรมชาติเพิ่มขึ้น
-  Operation Profit มี YoY เพิ่มขึ้นจากธุรกิจ P&R  ธุรกิจน้ำมันและการค้าปลีก(OR) และธุรกิจก๊าซธรรมชาติเพิ่มขึ้น
-  EBITDA เพิ่มขึ้นจากปริมาณการขายที่เพิ่มขึ้น ซึ่งเกิดจากความต้องการในกลุ่มโรงไฟฟ้าเพิ่มขึ้นตามฤดูการและโรงแยกก๊าซ, ราคาขายอ้างอิงผลิตภัณฑ์ปิโตรเคมีเพิ่มขึ้น, ธุรกิจระบบท่อก๊าซมีต้นทุนลดลง, ธุรกิจ NGV ขาดทุนลดลง,PTTLNG มีปริมาณจองใข้เพิ่มขึ้น
-  คาดการว่ากำไร 2Q67 จะลดลงทั้ง QoQ และ YoY เนื่องจากค่าการกลั่นลดลง, สเปรดปิโตรเคมีลดลง, กำไรจากธุรกิจก๊าซลดลง, อัตราค่าบริการจัดหาและค่าส่งก๊าซของ SSP ปรับลดลง, กำไรจาก PE LNG ลดลง, GPSC เพิ่มขึ้น, ส่วนแบ่งกำไรจากไซยะบุรีเร่งตัวขึ้น
-  แนะนำให้ซื้อเมื่ออ่อนตัว เพราะยังได้รับการกดดันราคาหุ้นจากนโยบายปรับโครงสร้างราคาก๊าซของภาครัฐ (Single pool gas) และ กกพ.เรียก Shortfall เพิ่ม
- ปัจจัยเสี่ยงที่พบคือภาวะชะลอตัวของเศรษฐกิจโลกและอัตราแลกเปลี่ยนมีความผันผวนและต่ำกว่าประมาณการ"
Output:
"กำไรปกติ 1Q67 เพิ่มขึ้นทั้ง QoQ, YoY
- กำไรปกติ 1Q67 เพิ่มขึ้นทั้ง QoQ, YoY จากธุรกิจ P&R ธุรกิจน้ำมันและการค้าปลีก และธุรกิจก๊าซธรรมชาติ
- กำไรจากธุรกิจก๊าซฯ แข็งแกร่งมาก แม้รวมผลกระทบจาก Shortfall ด้วยผลบวกจากปริมาณขายเพิ่มขึ้นตามความต้องการในกลุ่มโรงไฟฟ้า และต้นทุนเนื้อก๊าซลดลง
- แนวโน้มกำไรปกติ 2Q67F อ่อนลง QoQ, YoY ตามค่าการกลั่นที่ลดลง สเปรดปิโตรเคมีลดลง และกำไรจากธุรกิจก๊าซฯ ลดลง YoY จากฐานสูงในปีก่อน
- คงคำแนะนำ ""ซื้อเมื่ออ่อนตัว"" เพื่อเปิด Upside ให้เพิ่มขึ้นและเพิ่มอัตราเงินปันผล โดยมองว่าประเด็น Single Pool Gas จะเป็นประเด็นกดดันต่อราคาหุ้น

ประเด็นการลงทุน
- กำไรปกติ 1Q67 เพิ่มขึ้นทั้ง QoQ, YoY กำไรสุทธิ 1Q67 2.9 หมื่นล้านบาท (-12% QoQ, +4% YoY) ดีกว่าตลาดคาด การลดลง QoQ เกิดจากรายการพิเศษเป็นหลัก -1.1 หมื่นล้านบาท (4Q66 : 9.5 พันล้านบาท 1Q66 : 1.9 พันล้านบาท) รายการพิเศษหลัก คือ กำไรจากสต๊อก 2.6 พันล้านบาท และขาดทุนจาก FX & Derivatives -1.4 หมื่นล้านบาท Operating Profit แข็งแกร่งมาก 4.0 หมื่นล้านบาท (+72% QoQ, +55% YoY) การเพิ่มขึ้น QoQ เกิดจากธุรกิจ P&R (IRPC, PTTGC, TOP) ตามค่าการกลั่นเพิ่มขึ้นและสเปรดปิโตรเคมีเพิ่มขึ้น ธุรกิจน้ำมันและการค้าปลีก (OR) ตามกำไรขั้นต้นต่อลิตรเพิ่มขึ้น และกำไรจากธุรกิจ Lifestyle เพิ่มขึ้น GPSC ตามกำไรของ SPP เพิ่มขึ้น ธุรกิจ Trading จากฐานต่ำใน 4Q66 และธุรกิจก๊าซธรรมชาติจากปริมาณขายเพิ่มขึ้นและต้นทุนค่าเนื้อก๊าซลดลง ขณะที่การเพิ่มขึ้น YoY เกิดจากธุรกิจ P&R ธุรกิจน้ำมันและการค้าปลีก (OR) และธุรกิจก๊าซธรรมชาติที่เพิ่มขึ้น YoY จากฐานต่ำ ซึ่งมีน้ำหนักมากกว่าการลดลงของ GPSC ตามส่วนแบ่งกำไรจากไซยะบุรีลดลงมาก และธุรกิจ Trading จากฐานสูงใน 1Q66
- กำไรจากธุรกิจก๊าซฯ แข็งแกร่งมาก EBITDA ของธุรกิจก๊าซฯ อยู่ที่ 1.8 หมื่นล้านบาท (+3% QoQ, +62% YoY) แม้ว่าจะมีผลกระทบจากการนำ Shortfall แหล่งอ่าวไทย 4.3 พันล้านบาท มาคำนวณเป็นส่วนลดตามคำสั่ง กกพ. ก็ตาม การเพิ่มขึ้น QoQ เกิดจากปริมาณขายเพิ่มขึ้นเป็น 4,494 MMSCFD (+6% QoQ, +10% YoY) จากความต้องการในกลุ่มโรงไฟฟ้าเพิ่มขึ้นตามฤดูกาล (กฟผ. +13% QoQ, IPP +21%, SPP +1%) และโรงแยกก๊าซ +2% QoQ ตามความต้องการของกลุ่มปิโตรเคมี ประกอบกับต้นทุนค่าเนื้อก๊าซลดลงตามราคา LNG ตลาดโลก -5% QoQ, -26% YoY เป็น $8.33/MMBTU ขณะที่ราคาขายอ้างอิงผลิตภัณฑ์ปิโตรเคมีเพิ่มขึ้น นอกจากนั้น ยังเกิดจากธุรกิจระบบท่อส่งก๊าซฯ มีต้นทุนลดลง ธุรกิจ NGV ขาดทุนลดลงตามปริมาณขายลดลงและการปรับเพิ่มราคาขาย และธุรกิจอื่นๆ จาก PTTLNG มีปริมาณจองใช้เพิ่มขึ้น
- แนวโน้มกำไรปกติ 2Q67F อ่อนลง เราคาดว่ากำไรปกติ 2Q67F จะลดลงทั้ง QoQ, YoY ตามค่าการกลั่นที่ลดลง สเปรดปิโตรเคมีลดลง กำไรจากธุรกิจก๊าซฯ ลดลง YoY ตามฐานสูงใน 2Q66 และผลกระทบจากการปรับลดอัตราค่าบริการจัดหาและค้าส่งก๊าซฯ ของ SPP เต็มไตรมาสและการรับรู้กำไรจาก PE LNG ลดลงซึ่งมีน้ำหนักมากกว่าการเพิ่มขึ้นของกำไรจาก PTTEP ตามปริมาณขายเพิ่มขึ้น และ GPSC ตามมาร์จิ้นของโรงไฟฟ้า SPP เพิ่มขึ้นและส่วนแบ่งกำไรจากไซยะบุรีเร่งตัวขึ้น แต่ก็จะมีกำไรพิเศษจากการขายหุ้น PE LNG (ธุรกิจ LNG Receiving Terminal แห่งที่ 2) ให้กับ กฟผ. ราว 4.0 พันล้านบาท เข้ามาเพิ่มเติม

คำแนะนำ
แนะนำ ""ซื้อเมื่ออ่อนตัว"" เราคงคำแนะนำ ""ซื้อเมื่ออ่อนตัว"" เพื่อเปิด Upside ให้เพิ่มขึ้นและเพิ่มอัตราเงินปันผล โดยมองว่า PTT ยังมีประเด็นกดดันราคาหุ้นจากผลกระทบของนโยบายปรับโครงสร้างราคาก๊าซฯ ของภาครัฐ (Single Pool Gas) ซึ่งหากออกมาจะคิดย้อนหลังตั้งแต่ ม.ค. 67 และการเรียก Shortfall เพิ่มเติมจาก กกพ. ซึ่งจะกระทบต่อกำไรของธุรกิจก๊าซฯ และเป็น Downside risk ต่อประมาณการกำไร อย่างไรก็ตาม เราก็คาดว่า PTT ยังคงจ่ายเงินปันผลทั้งปี 2 บาท/หุ้น D/P 5.9% ได้

ปัจจัยเสี่ยง
ภาวะเศรษฐกิจโลกและราคาน้ำมัน ภาวะชะลอตัว/ชะงักงันของเศรษฐกิจโลกอาจส่งผลให้ราคาน้ำมันดิบโลก ค่าการกลั่น ส่วนต่างราคาปิโตรเคมีอะโรเมติกส์ และอัตราแลกเปลี่ยนมีความผันผวนและต่ำกว่าประมาณการ"
```
ชื่อหุ้น:
PTT
ข้อมูลเชิงลึก:
"-  กำไรสุทธิ 4Q66 3.3 หมื่นล้านบาท (+5%QoQ, +83%YoY)
-  ขาดทุนจากสต๊อก -1.2 หมื่นล้านบาท
-  การตั้งด้อยค่า -4.7 พันล้านบาท
-  กำไรจาก  FX & Derivatives 2.6 หมื่นล้านบาท
-  Operating Profit 2.3 หมื่นล้านบาท (-23%QoQ, +41%YoY)
-  EBITDA ธุรกิจก๊าซ 1.75 หมื่นล้านบาท (-7%QoQ, +47%YoY)
-  ปริมาณขาย 4253 MMSCFD (-7%QoQ, +9%YoY)"
ข่าวสาร/เหตการณ์ที่เกี่ยวข้อง:
"-  กำไรสุทธิมี QoQ ลดลงเพราะ ธุรกิจ P&R ที่ค่าการกลั่นลดลงและสเปรดปิโตรเคมีลดลง, ธุรกิจน้ำมันและการค้าปลีก (OR) ตามกำไรขั้นต้นต่อลิตรลดลง, GPSC ลดลง, ธุรกิจก๊าซธรรมชาติความต้องการลดลงตามฤดูการ, ต้นทุนค่าเนื้อก๊าซเพิ่มขึ้น, ธุรกิจ Trading ขาดทุน
-  กำไรสุทธิมี YoY เพิ่มขึ้นเพราะ ธุรกิจ P&R GPSC ตามกำไรจาก SPP เพิ่มขึ้น และธุรกิจก๊าซธรรมชาติ
-  EBITDA ม๊ QoQ ลดลงเพราะปริมาณขายกลุ่มโรงไฟฟ้าลดลงตามฤดูการ, ต้นทุนเนื้อก๊าซเพิ่มขึ้น, เสียค่าบำรุงธุรกิจท่อก๊าซ, ธุรกิจ Trading ขาดทุน
-  คาดการกำไร 1Q67 ลดลงทั้ง QoQ และ YoY เนื่องจากการปรับโครงสร้างราคาก๊าซทำให้ต้นทุนเพิ่มขึ้น และต้องจ่าย shortfall
-  แนะนำให้ซื้อเมื่ออ่อนตัว เนื่องจากแนวโน้มกำไร 1Q67 ที่ลดลงและนโยบายปรับโครงสร้างราคาก๊าซของภาครัฐในอนาคตอาจเป็น Overhang
-  ปัจจัยเสี่ยงที่พบคือภาวะชะลอตัวของเศรษฐกิจโลกและอัตราแลกเปลี่ยนมีความผันผวนและต่ำกว่าประมาณการ"
Output:
'''
'''
instr0 = Role + Context + Instruction
instr1 = Role + One-shot
'''

prompt = [{"role": "user", "content": instr0 }]
tokenized_prompt = tokenizer.apply_chat_template(prompt, add_generation_prompt=True, return_dict=True, return_tensors="pt").to(model.device)

out = model.generate(**tokenized_prompt, max_new_tokens=512)
result = tokenizer.decode(out[0])
print(result)